cask_args appdir: "/Applications"

# Utility
brew "jq"
brew "peco"
brew "nmap"
brew "tree"
brew "bat"

# AWS
brew "awscli"
brew "git-remote-codecommit"

tap "iann0036/iamlive"
brew "iann0036/iamlive/iamlive"

tap "jimon-s/awsmfa"
brew "jimon-s/awsmfa/awsmfa"

tap "jimon-s/pipeline-lens"
brew "jimon-s/pipeline-lens/pipeline-lens"

cask "session-manager-plugin"

# Git
brew "git"
brew "gh"
brew "ghq"
brew "git-secrets"
brew "gibo"

# Docker
# NOTE: In commercial use, you mustn't use docker desktop without payment.
#
# If you want to make docker environment without docker desktop,
# use 'brew docker' instead of  'cask docker'.
# brew "docker"
cask "docker"

# xxenv
brew "tfenv"
brew "pipenv"
brew "pyenv"
brew "rbenv"
brew "goenv", args: ["HEAD"]

# terraform
brew "tflint"

# Java
cask "corretto11"
brew "maven"
brew "gradle"

# Swift
brew "swiftlint"

# Vim
brew "neovim"

# Font
tap "delphinus/sfmono-square"
brew "sfmono-square"
