cask_args appdir: "/Applications"

brew "zsh"

# Utility
brew "jq"
brew "fzf"
brew "nmap"
brew "tree"
brew "bat"
brew "ripgrep"

# AWS
brew "awscli"
brew "git-remote-codecommit"

tap "donngi/awsmfa"
brew "donngi/awsmfa/awsmfa"

tap "donngi/pipeline-lens"
brew "donngi/pipeline-lens/pipeline-lens"

# Git
brew "git"
brew "gh"
brew "ghq"
brew "git-secrets"
brew "gibo"

# xxenv
brew "tfenv"
brew "pipenv"
brew "pyenv"
brew "rbenv"

# terraform
brew "tflint"

# Java
brew "maven"
brew "gradle"

# Go
brew "go"

# Vim
brew "neovim"

# LSP servers
brew "lua-language-server"
brew "gopls"
brew "pyright"
brew "ruff"
brew "vtsls"
brew "bash-language-server"
brew "yaml-language-server"
brew "terraform-ls"
brew "biome"

# Formatters
brew "stylua"
brew "gofumpt"
brew "shfmt"

# Linters
brew "shellcheck"
brew "yamllint"

# Prompt
brew "pure"
